Microchip-MPLAB-Harmony/csp/apps/dacc/dacc_wav_gen/firmware/src/packs/ATSAMV71Q21B_DFP/component/matrix.h
/* -------- MATRIX_WPSR : (MATRIX Offset: 0x1E8) (R/  32) Write Protection Status Register -------- */
#define MATRIX_WPSR_WPVS_Pos                  (0U)                                           /**< (MATRIX_WPSR) Write Protection Violation Status Position */
#define MATRIX_WPSR_WPVS_Msk                  (0x1U << MATRIX_WPSR_WPVS_Pos)                 /**< (MATRIX_WPSR) Write Protection Violation Status Mask */
#define MATRIX_WPSR_WPVS(value)               (MATRIX_WPSR_WPVS_Msk & ((value) << MATRIX_WPSR_WPVS_Pos))
#define MATRIX_WPSR_WPVSRC_Pos                (8U)                                           /**< (MATRIX_WPSR) Write Protection Violation Source Position */
#define MATRIX_WPSR_WPVSRC_Msk                (0xFFFFU << MATRIX_WPSR_WPVSRC_Pos)            /**< (MATRIX_WPSR) Write Protection Violation Source Mask */
#define MATRIX_WPSR_WPVSRC(value)             (MATRIX_WPSR_WPVSRC_Msk & ((value) << MATRIX_WPSR_WPVSRC_Pos))
#define MATRIX_WPSR_Msk                       (0x00FFFF01UL)                                 /**< (MATRIX_WPSR) Register Mask  */

/** \brief MATRIX register offsets definitions */
#define MATRIX_MCFG_OFFSET             (0x00)         /**< (MATRIX_MCFG) Master Configuration Register 0 Offset */
#define MATRIX_SCFG_OFFSET             (0x40)         /**< (MATRIX_SCFG) Slave Configuration Register 0 Offset */
#define MATRIX_PR_OFFSET               (0x80)         /**< (MATRIX_PR) Priority Register A for Slave 0 Offset */
  #define MATRIX_PRAS_OFFSET             (0x00)         /**< (MATRIX_PRAS) Priority Register A for Slave 0 Offset */
  #define MATRIX_PRBS_OFFSET             (0x04)         /**< (MATRIX_PRBS) Priority Register B for Slave 0 Offset */
#define MATRIX_MRCR_OFFSET             (0x100)        /**< (MATRIX_MRCR) Master Remap Control Register Offset */
#define CCFG_CAN0_OFFSET               (0x110)        /**< (CCFG_CAN0) CAN0 Configuration Register Offset */
#define CCFG_SYSIO_OFFSET              (0x114)        /**< (CCFG_SYSIO) System I/O and CAN1 Configuration Register Offset */
#define CCFG_PCCR_OFFSET               (0x118)        /**< (CCFG_PCCR) Peripheral Clock Configuration Register Offset */
#define CCFG_DYNCKG_OFFSET             (0x11C)        /**< (CCFG_DYNCKG) Dynamic Clock Gating Register Offset */
#define CCFG_SMCNFCS_OFFSET            (0x124)        /**< (CCFG_SMCNFCS) SMC NAND Flash Chip Select Configuration Register Offset */
#define MATRIX_WPMR_OFFSET             (0x1E4)        /**< (MATRIX_WPMR) Write Protection Mode Register Offset */
#define MATRIX_WPSR_OFFSET             (0x1E8)        /**< (MATRIX_WPSR) Write Protection Status Register Offset */

/** \brief MATRIX_PR register API structure */
typedef struct
{
  __IO  uint32_t                       MATRIX_PRAS;     /**< Offset: 0x00 (R/W  32) Priority Register A for Slave 0 */
  __IO  uint32_t                       MATRIX_PRBS;     /**< Offset: 0x04 (R/W  32) Priority Register B for Slave 0 */
} matrix_pr_registers_t;
#define MATRIX_PR_NUMBER (9U)

/** \brief MATRIX register API structure */
typedef struct
{
  __IO  uint32_t                       MATRIX_MCFG[13]; /**< Offset: 0x00 (R/W  32) Master Configuration Register 0 */
  __I   uint8_t                        Reserved1[0x0C];
  __IO  uint32_t                       MATRIX_SCFG[9];  /**< Offset: 0x40 (R/W  32) Slave Configuration Register 0 */
  __I   uint8_t                        Reserved2[0x1C];
        matrix_pr_registers_t          MATRIX_PR[MATRIX_PR_NUMBER]; /**< Offset: 0x80 Priority Register A for Slave 0 */
  __I   uint8_t                        Reserved3[0x38];
  __IO  uint32_t                       MATRIX_MRCR;     /**< Offset: 0x100 (R/W  32) Master Remap Control Register */
  __I   uint8_t                        Reserved4[0x0C];
  __IO  uint32_t                       CCFG_CAN0;       /**< Offset: 0x110 (R/W  32) CAN0 Configuration Register */
  __IO  uint32_t                       CCFG_SYSIO;      /**< Offset: 0x114 (R/W  32) System I/O and CAN1 Configuration Register */
  __IO  uint32_t                       CCFG_PCCR;       /**< Offset: 0x118 (R/W  32) Peripheral Clock Configuration Register */
  __IO  uint32_t                       CCFG_DYNCKG;     /**< Offset: 0x11c (R/W  32) Dynamic Clock Gating Register */
  __I   uint8_t                        Reserved5[0x04];
  __IO  uint32_t                       CCFG_SMCNFCS;    /**< Offset: 0x124 (R/W  32) SMC NAND Flash Chip Select Configuration Register */
  __I   uint8_t                        Reserved6[0xBC];
  __IO  uint32_t                       MATRIX_WPMR;     /**< Offset: 0x1e4 (R/W  32) Write Protection Mode Register */
  __I   uint32_t                       MATRIX_WPSR;     /**< Offset: 0x1e8 (R/   32) Write Protection Status Register */
} matrix_registers_t;
/** @}  end of AHB Bus Matrix */

#endif /* SAMV_SAMV71_MATRIX_MODULE_H */

